---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartInvalidConnection
source: html/c2cb7c29-98ef-2590-6312-2d2327471834.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartInvalidConnection Property

Fabrication Part connection invalid and could not be automatically coupled.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartInvalidConnection { get; }
```